In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(6, datetime.datetime(2018, 11, 21, 0, 57, 58, 796000), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (7, datetime.datetime(2018, 11, 21, 0, 58, 41, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (8, datetime.datetime(2018, 11, 21, 1, 2, 5, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (9, datetime.datetime(2018, 11, 21, 1, 3, 13, 796000), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (11, datetime.datetime(2018, 11, 21, 1, 5, 29, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(66, 'Kevin', 'Arellano', 'M', 'free'),
 (91, 'Jayden', 'Bell', 'M', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'paid'),
 (67, 'Colm', 'Santana', 'M', 'free'),
 (19, 'Zachary', 'Thomas', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 21, 0, 57, 58, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 0, 58, 41, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 2, 5, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 3, 13, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 5, 29, 796000), 1, 21, 47, 11, 2018, 2)]